rhgndf/py32-data/svd/PY32L090xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>External interrupt/event controller</description>
      <baseAddress>0x40010400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD Interrupt through EXTI Lines 16</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>EXTI0_1</name>
        <description>EXTI Line 0 and 1 Interrupt</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>EXTI2_3</name>
        <description>EXTI Line 2 and 3 Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI4_15</name>
        <description>EXTI Line 4 to 15 Interrupt</description>
        <value>7</value>
      </interrupt>
      <registers>
        <register>
          <name>RTSR</name>
          <description>EXTI rising trigger selection register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RT0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RT1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RT2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RT3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RT4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RT5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RT6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RT7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RT8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RT9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RT10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RT11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RT12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RT13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RT14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RT15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RT16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RT17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RT18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RT19</name>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <description>EXTI falling trigger selection register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FT0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FT1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FT2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FT3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FT4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FT5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FT6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FT7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FT8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FT9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FT10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FT11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FT12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FT13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FT14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FT15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FT16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FT17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>FT18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FT19</name>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <description>EXTI software interrupt event register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SWIE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWIE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWIE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWIE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SWIE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWIE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWIE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWIE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SWIE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SWIE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SWIE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SWIE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SWIE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SWIE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SWIE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SWIE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SWIE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SWIE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWIE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SWIE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>EXTI pending register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PR0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PR1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PR2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PR3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PR4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PR5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PR6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PR7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PR8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PR9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PR10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PR11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PR12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PR13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PR16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PR17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PR18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PR19</name>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSEL1</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EXTI0SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI1SEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI2SEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI3SEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EXTI4SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI5SEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>EXTI6SEL</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>EXTI7SEL</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSEL2</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EXTI8SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI9SEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI10SEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI11SEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EXTI12SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI13SEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>EXTI14SEL</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>EXTI15SEL</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>EXTI CPU wakeup with interrupt mask register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>IM0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IM1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IM2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IM3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IM4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IM5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IM6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IM7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IM8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IM9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IM10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IM11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IM12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IM13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IM14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IM15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IM16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IM17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IM18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IM19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IM20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IM21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>IM22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IM23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IM24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IM25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IM26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>IM27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>IM28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IM29</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>EXTI CPU wakeup with event mask register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EM0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EM1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EM2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EM3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EM4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EM5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EM6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EM7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EM8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EM9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EM10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EM11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EM12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EM13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EM14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EM15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EM16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EM17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EM18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EM19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EM20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EM21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EM22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EM23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EM24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EM25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EM26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EM27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EM28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EM29</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
