rhgndf/py32-data/svd/PY32L090xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPTIM1">
      <name>LPTIM2</name>
      <baseAddress>0x40009400</baseAddress>
    </peripheral>
    <peripheral>
      <name>LPUART1</name>
      <groupName>LPUART</groupName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>UE</name>
              <description>LPUART enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UESM</name>
              <description>LPUART enabled in Stop mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE</name>
              <description>Receive enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TE</name>
              <description>Transfer enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLE interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EXNEIE</name>
              <description>Receive register untempered enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>End of Transfer interrupt enabled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>Transmit Register Empty Break Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PEIE</name>
              <description>PE interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PS</name>
              <description>Parity selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PCE</name>
              <description>Parity control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <description>Receive wake-up mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>Configure the word length in combination with M1</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>MME</name>
              <description>Silent mode enabled</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMIE</name>
              <description>Character match interrupt enabled</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DEDT</name>
              <description>The time between the transmit frame stop bit and the invalid DE (driver enable) signal</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>DEAT</name>
              <description>The time between the DE (driver enable) signal validity and the start bit</description>
              <bitRange>[25:21]</bitRange>
            </field>
            <field>
              <name>M1</name>
              <description>The value of {M1,M0} the configurate length</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>ADDM7</name>
              <description>7bit/4bit address detection configuration</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop bit configuration</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>SWAP</name>
              <description>TX/RX pin interchangeable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <description>The RX pin is active level inverting</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TXINV</name>
              <description>TX pin active level inverted</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DATAINV</name>
              <description>Inverse binary data processing</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MSBFIRST</name>
              <description>MSB first</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXOE_ALWAYS_ON</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADD</name>
              <description>LPUART address</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EIE</name>
              <description>Error interrupts are enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HDSEL</name>
              <description>Half-duplex selection</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAR</name>
              <description>Enable DMA on reception</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMAT</name>
              <description>Enable DMA while transmitting</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTSE</name>
              <description>RTS enabled</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTSE</name>
              <description>CTS enabled</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CTSIE</name>
              <description>CTS interrupt enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVRDIS</name>
              <description>Overrun is prohibited</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DDRE</name>
              <description>Whether DMA is disabled when receiving an error</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DEM</name>
              <description>DE mode enabled</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DEP</name>
              <description>DE polarity selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WUS</name>
              <description>Low-power wake-up options</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>WUFIE</name>
              <description>Low-power wake-up interrupt enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>BBR</name>
              <description>LPUART baud rate</description>
              <bitRange>[19:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPWKUP_BRR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>LPWKUP_BBR</name>
              <description>LPUART lpwkup baud rate</description>
              <bitRange>[19:0]</bitRange>
            </field>
            <field>
              <name>HW_BRR_UPEN</name>
              <description>LPUART wkup brr update enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SBKRQ</name>
              <description>Send an abort request</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MMRQ</name>
              <description>Silent mode request</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>Frame error flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NE</name>
              <description>START bit noise flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <description>Overrun error flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>idle flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>RX register not empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission completion flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>TX register empty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTSIF</name>
              <description>CTS interrupt flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS</name>
              <description>CTS flag</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy flag</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMF</name>
              <description>Address match flag</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SBKF</name>
              <description>Send abort flag</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RWU</name>
              <description>Receive Mute mode wake-up flag</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF</name>
              <description>Wake flag from low-power mode</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEACK</name>
              <description>Transport enable acknowledgement flag</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REACK</name>
              <description>Receive the enable acknowledgment flag</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>PECF</name>
              <description>Check value error flag reset</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FECF</name>
              <description>Frame error flag reset</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>NECF</name>
              <description>Clear the START bit noise flag</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ORECF</name>
              <description>Overrun error flag reset</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>IDLECF</name>
              <description>Clear idle flag</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TCCF</name>
              <description>Transfer completion flag reset</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTSCF</name>
              <description>CTS flag reset</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CMCF</name>
              <description>Address matching flag reset</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WUCF</name>
              <description>Low power wake-up flag reset</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>RDR</name>
              <description>Receive Data Register</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>TDR</name>
              <description>Transmit Data Register</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESC</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>Input clock prescaler register</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>DBGSEL</name>
              <description>debug select</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OFFSET_ADD</name>
              <description>offset add</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
