rhgndf/py32-data/svd/PY32L090xx.svd
        <register>
          <name>PUCRD</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PU0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PU1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PU2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PU3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PU4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PU5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PU6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PU7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PU8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PU9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PU10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PU11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PU12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PU13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PU14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PU15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRD</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>PD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC and CTC global Interrupts</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Clock control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MSIDIV</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>HSIKERON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MSION</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HSION</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MSIRDY</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIDIV</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HSE_CSSON</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLON</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <description>Internal clock sources calibration register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>HSI_TRIMCR</name>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>HSI_FS_OP</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>Clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>HPRE</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PPRE</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MCOSEL</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MCOPRE</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <description>PLL configuration register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLLMUL</name>
              <bitRange>[6:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>HSE_RDYSEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>HSE_FILT_EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <description>Clock interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MSIRDYIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSECSSF</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>LSERDYC</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSIRDYC</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSERDYC</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>PLLRDYC</name>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CSSC</name>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>LSECSSC</name>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCRST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIODRST</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <description>APB peripheral reset register 1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TIM2RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM6RST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7RST</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWMRST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WWDGRST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LPUART2RST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>USART2RST</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UART1RST</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>UART2RST</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>LPUART1RST</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2RST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>OPARST</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DBGRST</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACRST</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>LPTIM2RST</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LPTIM1RST</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <description>APB peripheral reset register 2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM15RST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCRST</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1RST</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2RST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCDRST</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TKRST</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>VREFBUFRST</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPENR</name>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIODEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR</name>
          <description>AHB peripheral clock enable register</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASHEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRAMEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR1</name>
          <description>APB peripheral clock enable register 1</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>TIM2EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM6EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWMEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LPUART2EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>USART2EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UART1EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>UART2EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>LPUART1EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>OPAEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DBGEN</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>LPTIM2EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LPTIM1EN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
